export default function MenuSection() {
  return (
    <div className=" bg-[var(--background)] text-center font-hebrew p-6">
      <div className="flex gap-6 w-full justify-center items-center mb-8">
        <span className="h-[3px] w-[40%] bg-[var(--Wine-Red)] rounded-2xl" />

        <h1 className="text-[var(--Wine-Red)] text-2xl  font-hebrew">תפריט</h1>

        <span className="h-[3px] w-[40%] bg-[var(--Wine-Red)] rounded-2xl" />
      </div>
      <p>
        מנות פתיחה ועיקריות התפריט של אומניה מציג איזון בין נגיעות גליליות
        מסורתיות למנות מוקפדות בסגנון ביסטרו. בין מנות הפתיחה תמצאו סלט עגבניות
        עם שנקליש, קובה נייה בלחם שראק, טרטר בקר עם באבא גנוש,. כל מנה נבנית
        בקפידה, עם דגש על חומרי גלם איכותיים ופרזנטציה מדויקת. בעיקריות מככבים
        נתחים מובחרים שנחתכים במיוחד עבור המסעדה: טומהוק – נתח עצום ומרשים המוגש
        עם העצם הארוכה, משלב עסיסיות של אנטריקוט עם מראה דרמטי שמגניב את השולחן.
        פורטרהאוס – נתח דו-צדדי שמחבר בין פילה רך לסינטה העטופה בפס שומן –
        הבחירה המושלמת למי שלא רוצה לבחור. ניו יורק – נתח סינטה קלאסי, דק יותר
        ובעל מרקם בשרני ונקי. לצדם תמצאו גם קלאסיקות נוספות כמו המבורגר 220 גרם,
        שניצל שייטל, קבב אדנה עסיסי, ומבחר תוספות טריות ומפתיעות. לסיום, מחכים
        לכם קינוחים מושקעים
      </p>
    </div>
  );
}
